[
    {
        "open": "101.000000",
        "high": "105.150000",
        "low": "101.000000",
        "volume": "3967162.000000",
        "overnight_volume": "0.000000",
        "bounds": "regular",
        "market_date": "2025-05-23",
        "average_volume_2_weeks": "6112686.200000",
        "average_volume": "6112686.200000",
        "average_volume_30_days": "7981655.181820",
        "high_52_weeks": "155.840000",
        "high_52_weeks_date": "2025-01-24",
        "dividend_yield": "0.119962",
        "float": "373301112.915000",
        "low_52_weeks": "53.600000",
        "low_52_weeks_date": "2025-04-07",
        "market_cap": "39684482698.195068",
        "pb_ratio": "14.889100",
        "pe_ratio": "60.412801",
        "shares_outstanding": "381105182.927063",
        "description": "Vertiv Holdings Co. engages in the design, manufacture, and service of critical digital infrastructure technology for data centers, communication networks, and commercial and industrial environments. It also offers power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure. It operates through the following geographical segments: Americas, Asia Pacific, and Europe, Middle East, and Africa (EMEA). The Americas segment offers products and services sold for applications within the data center, communication networks, and commercial and industrial markets in North America and Latin America. The Asia Pacific segment includes products and services sold for applications within the data center, communication networks, and commercial or industrial markets throughout Greater China, Australia and New Zealand, Southeast Asia, and India. The EMEA segment focuses on products and services sold for applications within the data center, communication networks, and commercial and industrial markets in Europe, Middle East, and Africa. The company was founded in 1946 and is headquartered in Columbus, OH.",
        "instrument": "https://api.robinhood.com/instruments/20e966b3-6aa1-4281-9bf0-5db52e2e8868/",
        "ceo": "Giordano Albertazzi",
        "headquarters_city": "Westerville",
        "headquarters_state": "Ohio",
        "sector": "Electronic Technology",
        "industry": "Electronic Production Equipment",
        "num_employees": 31000,
        "year_founded": 1946,
        "payable_date": "2025-03-27",
        "ex_dividend_date": "2025-03-18",
        "financial_status_indicator": "CA0",
        "financial_status_description": "",
        "symbol": "VRT"
    }
]