[
    {
        "open": "501.005000",
        "high": "505.499000",
        "low": "500.297200",
        "volume": "3165461.000000",
        "overnight_volume": "0.000000",
        "bounds": "regular",
        "market_date": "2025-05-23",
        "average_volume_2_weeks": "4470023.100000",
        "average_volume": "4470023.100000",
        "average_volume_30_days": "4981803.318180",
        "high_52_weeks": "542.070000",
        "high_52_weeks_date": "2025-05-02",
        "dividend_yield": null,
        "float": "1337588152.760000",
        "low_52_weeks": "401.580000",
        "low_52_weeks_date": "2024-05-29",
        "market_cap": "1086489455607.319336",
        "pb_ratio": "1.659920",
        "pe_ratio": "13.419122",
        "shares_outstanding": "2158300310.800882",
        "description": "Berkshire Hathaway, Inc. is a holding company, which engages in the provision of property and casualty insurance and reinsurance, utilities and energy, freight rail transportation, finance, manufacturing, and retailing services. It operates through the following segments: Insurance, Burlington Northern Santa Fe, LLC (BNSF), Berkshire Hathaway Energy (BHE), Pilot Travel Centers (PTC), Manufacturing, McLane, and Service and Retailing. The Insurance segment includes the underwriting of GEICO, Berkshire Hathaway Primary Group, and Berkshire Hathaway Reinsurance Group. The BNSF segment involves the operation of railroad systems. The BHE segment focuses on regulated electric and gas utility, power generation and distribution, and real estate brokerage activities. The PTC segment consists of managing travel centers and marketing of wholesale fuel. The Manufacturing segment refers to industrial, consumer and building products, home building, and related financial services. The McLane segment covers the wholesale distribution of groceries and non-food items. The Service and Retailing segment relates to the provision of shared aircraft ownership programs, aviation pilot training, electronic components distribution, retailing businesses, automobile dealerships and trailer, and furniture leasing services. The company was founded by Oliver Chace in 1839 and is headquartered in Omaha, NE.",
        "instrument": "https://api.robinhood.com/instruments/a4f0cca4-79dc-4297-9c02-5bce1909cd4b/",
        "ceo": "Warren Edward Buffett",
        "headquarters_city": "Omaha",
        "headquarters_state": "Nebraska",
        "sector": "Finance",
        "industry": "Property/Casualty Insurance",
        "num_employees": 392400,
        "year_founded": 1839,
        "payable_date": null,
        "ex_dividend_date": null,
        "financial_status_indicator": "CA0",
        "financial_status_description": "",
        "symbol": "BRK.B"
    }
]