[
    {
        "open": "197.550000",
        "high": "201.992900",
        "low": "197.550000",
        "volume": "524237.000000",
        "overnight_volume": "0.000000",
        "bounds": "regular",
        "market_date": "2025-05-23",
        "average_volume_2_weeks": "690855.900000",
        "average_volume": "690855.900000",
        "average_volume_30_days": "867792.227273",
        "high_52_weeks": "246.500000",
        "high_52_weeks_date": "2025-02-19",
        "dividend_yield": "1.488243",
        "float": "162548118.266000",
        "low_52_weeks": "158.380000",
        "low_52_weeks_date": "2024-06-17",
        "market_cap": "38616115192.925499",
        "pb_ratio": "4.749290",
        "pe_ratio": "26.554431",
        "shares_outstanding": "192541459.876972",
        "description": "Garmin Ltd. is a holding company, which engages in the provision of navigation, communications and information devices, most of which are enabled by Global Positioning System (GPS) technology. It operates through the following segments: Marine, Outdoor, Fitness, Auto OEM, Consumer Auto, and Aviation. The Marine segment manufactures and offers recreational marine electronics such as cartography, Sounders, Radar, Autopilot Systems and Sailing. The Outdoor segment offers products designed for use in outdoor activities such as Outdoor Handhelds, Adventure Watches, Golf Devices, Dog Tracking & Training Device, Garmin Connect & Garmin Connect Mobile, and Connect IQ. The Fitness segment refers to the products designed for use in fitness and activity tracking such as Running & Multi-Sport Watches, Cycling Computers, Power Meters, Safety & Awareness, and Activity Tracking Devices. The Auto OEM and Consumer Auto segments offer products designed for use in the auto market such as Personal Navigation Devices, Original Equipment Manufacturer (OEM) Solutions, and Cameras. The Aviation segment provides solutions to aircraft manufacturers, existing aircraft owners and operators, as well as government/defense customers. The company was founded in 1989 and is headquartered in Schaffhausen, Switzerland.",
        "instrument": "https://api.robinhood.com/instruments/c7b07f89-07c3-49e3-a3bb-f66ac61132a5/",
        "ceo": "Clifton Albert Pemble",
        "headquarters_city": "Schaffhausen",
        "headquarters_state": "Schaffhausen",
        "sector": "Electronic Technology",
        "industry": "Telecommunications Equipment",
        "num_employees": 21800,
        "year_founded": 1989,
        "payable_date": "2026-03-27",
        "ex_dividend_date": "2026-03-13",
        "financial_status_indicator": "CA0",
        "financial_status_description": "",
        "symbol": "GRMN"
    }
]